Revit 2027 API
BuiltInFailures.LegendFailures Class
 Failures about Legend.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.LegendFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class LegendFailures
Public NotInheritable Class LegendFailures
public ref class LegendFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type LegendFailures = class end
The BuiltInFailures.LegendFailures type exposes the following members.
Properties
Name | Description
LegendComponentBadViewType |  Legend Components may only be placed in Legends
LegendComponentNotVisible |  The component you have selected is not visible in the selected view.
Top
See Also
Reference
Autodesk.Revit.DB Namespace